Repository: devKennies26/Karandash
Catalog: src/Shared/Karandash.Shared/Resources/Messages.*.resx
Languages: ru, tr

# GeneralMessageErrorOccured
source: A system error occurred!
ru: Произошла системная ошибка!
tr: Sistem hatası oluştu!

# GreetingMessage
source: Hello, {0} {1}! Welcome!
ru: Здравствуйте, {0} {1}! Добро пожаловать!
tr: Merhaba, {0} {1}! Hoş geldiniz!

# AnUnhandledException
source: An unexpected error occurred.
ru: Произошла непредвиденная ошибка.
tr: Beklenmeyen bir hata oluştu.

# TermsAndPolicyNotAccepted
source: You have not accepted the terms and policy.
ru: Вы не приняли условия использования и политику.
tr: Kullanım şartlarını ve politikayı kabul etmediniz.

# EmailAlreadyExists
source: This email is already in use by an active account.
ru: Этот адрес электронной почты уже используется активной учетной записью.
tr: Bu e-posta zaten aktif bir hesap tarafından kullanılmaktadır.

# PasswordInvalid
source: Password must be at least 8 characters long, contain one uppercase letter, one number, and one special character.
ru: Пароль должен содержать минимум 8 символов, одну заглавную букву, одну цифру и один специальный символ.
tr: Parola en az 8 karakter uzunluğunda olmalı, bir büyük harf, bir rakam ve bir özel karakter içermelidir.

source: User registered successfully.
ru: Пользователь успешно зарегистрирован.
tr: Kullanıcı başarıyla kaydedildi.

source: User registration failed.
ru: Регистрация пользователя не удалась.
tr: Kullanıcı kaydı başarısız oldu.

source: Invalid user role.
ru: Неверная роль пользователя.
tr: Geçersiz kullanıcı rolü.

source: Passwords do not match.
ru: Пароли не совпадают.
tr: Şifreler eşleşmiyor.

# FieldRequired
source: {0} is required.
ru: Требуется {0}.
tr: {0} alanı gereklidir.

# FieldMaxLength
source: {0} cannot exceed {1} characters.
ru: {0} не может превышать {1} символов.
tr: {0} en fazla {1} karakter olabilir.

# FieldMinLength
source: {0} must be at least {1} characters long.
ru: {0} должен быть не менее {1} символов.
tr: {0} en az {1} karakter olmalıdır.

source: Invalid email format.
ru: Неверный формат email.
tr: Geçersiz email formatı.

# FieldName-Name
source: 'Name'
ru: 'Имя'
tr: 'Ad'

# FieldName-Surname
source: 'Surname'
ru: 'Фамилия'
tr: 'Soyad'

# FieldName-Email
source: 'Email'
ru: 'Эл. почта'

# FieldName-Password
source: 'Password'
ru: 'Пароль'
tr: 'Şifre'

# FieldName-ConfirmPassword
source: 'Confirm Password'
ru: 'Подтверждение пароля'
tr: 'Parol Onayı'

# EmailBelongsToDeletedUser
source: This email was previously used, but the account has been deleted. Please use a different email or restore your old account.
ru: Этот адрес электронной почты ранее использовался, но учетная запись была удалена. Пожалуйста, используйте другой адрес или восстановите старую учетную запись.
tr: Bu e-posta daha önce kullanılmış ancak hesap silinmiştir. Lütfen farklı bir e-posta girin veya eski hesabınızı geri yükleyin.

# InvalidEmailOrPassword
source: The email or password you entered is incorrect. Please check your details and try again.
ru: Адрес электронной почты или пароль введены неверно. Пожалуйста, проверьте данные и попробуйте снова.
tr: Girdiğiniz e-posta veya şifre hatalı. Lütfen bilgilerinizi kontrol edip tekrar deneyin.

# AccountDeleted
source: This account has been deleted. Please restore your account to continue.
ru: Эта учетная запись была удалена. Чтобы продолжить, восстановите свой аккаунт.
tr: Bu hesap silinmiştir. Devam etmek için lütfen hesabınızı geri yükleyin.

# InvalidRefreshToken
source: Invalid refresh token provided.
ru: Предоставлен недействительный refresh-токен.
tr: Geçersiz yenileme tokeni sağlandı.

# RefreshTokenExpired
source: Refresh token has expired. Please log in again.
ru: Срок действия refresh-токена истёк. Пожалуйста, войдите снова.
tr: Yenileme tokeninin süresi dolmuş. Lütfen tekrar giriş yapın.

# UserNotFoundForPasswordReset
source: No user was found with this email address.
ru: Пользователь с таким адресом электронной почты не найден.
tr: Bu e-posta adresi ile kayıtlı kullanıcı bulunamadı.

# PasswordReset-EmailMessage
source: Request received. Please check your email for the password reset link.
ru: Запрос получен. Пожалуйста, проверьте свою электронную почту для сброса пароля.
tr: İstek alındı. Lütfen şifre sıfırlama bağlantısı için e-postanızı kontrol edin.

# FieldName-NewPassword
source: 'Новый пароль'
ru: 'New Password'
tr: 'Yeni Parola'

# FieldName-Token
source: 'Access Code'
ru: 'Код доступа'
tr: 'Erişim Kodu'

# InvalidPasswordToken
source: Password reset token not found or expired.
ru: Токен для сброса пароля не найден или срок действия истек.
tr: Şifre sıfırlama jetonu bulunamadı veya süresi dolmuş.

# PasswordReset-Success
source: Password reset successfully.
ru: Пароль успешно изменен.
tr: Şifre başarıyla değiştirildi.

# UserRoleAreNotAllowed
source: The selected user role is not allowed for registration.
ru: Выбранная роль пользователя недоступна для регистрации.
tr: Seçilen kullanıcı rolü kayıtta kullanılmasına izin verilmemektedir.
